根據題目給的 DataFrame 完成下列操作：
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False

In [2]:
import numpy as np
import pandas as pd

In [55]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data,index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [8]:
for ani in set (df['animal']):
    print(ani,df[df['animal']==ani]['age'].mean())

cat 2.5
dog 5.0
snake 2.5

In [15]:
df1 = df.sort_values(by=['age'])
df2 = df1.sort_values(by=['visits'],ascending=False)
df2

  animal  age  visits priority
f    cat  2.0       3       no
b    cat  3.0       3      yes
d    dog  NaN       3      yes
c  snake  0.5       2       no
e    dog  5.0       2       no
i    dog  7.0       2       no
a    cat  2.5       1      yes
j    dog  3.0       1       no
g  snake  4.5       1       no
h    cat  NaN       1      yes

一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [56]:
df = pd.DataFrame(np.random.random(size=(5, 3)),columns=['A','B','C'])
df

          A         B         C
0  0.061598  0.799123  0.414742
1  0.733513  0.659966  0.276439
2  0.844556  0.498764  0.150640
3  0.563114  0.902194  0.383136
4  0.239722  0.173649  0.397874

In [35]:
col_mean =df.mean(axis=0)

df_1 = df-col_mean
df_1

          A         B         C
0  0.076920  0.296830  0.268750
1 -0.259142 -0.387184  0.039919
2 -0.214158  0.086031 -0.498005
3  0.247596  0.165717 -0.084564
4  0.148784 -0.161393  0.273900

In [58]:
df.mean(axis=0)

A    0.488501
B    0.606739
C    0.324566
dtype: float64

承上題，請問：

* 1) 哪一比的資料總合最小
* 2) 哪一欄位的資料總合最小

In [51]:
row_sum =df.sum(axis=1)

row_sum

0    2.475650
1    1.226742
2    1.207017
3    2.161898
4    2.094442
dtype: float64

In [48]:
col_sum =df.sum(axis=0)

col_sum

A    3.509152
B    2.975637
C    2.680960
dtype: float64